// 约数，又称因数。整数a除以整数b(b≠0) 除得的商正好是整数而没有余数，
// 我们就说a能被b整除，或b能整除a。a称为b的倍数，b称为a的约数。
// 1.试除法求一个数的所有约数->与质数差不多
// 2.约数个数	例如：https://blog.csdn.net/qq_40596572/article/details/104857361
// 24 -> 8个约数
// 24 = 2*2*2*3 = 2^3 * 3 -> (3 + 1)(1 + 1) = 8
// 证明：https://baike.baidu.com/item/%E7%BA%A6%E6%95%B0%E5%92%8C%E5%AE%9A%E7%90%86/3808428?fr=aladdin
// 约数:1,2,3,4,6,8,12,24
// 2^0 = 1, 2^1 = 2, 2^2 = 4, 2^3 = 8;
// 3^0 = 1, 3^1 = 3;
// 1*1, 1*3, 2*1, 2*3, 4*1, 4*3, 8*1, 8*3
// 1, 3, 2, 6, 4, 12, 8, 24
// 3.约数之和
// 4.欧几里得算法（也叫辗转相除法）